public class HightTemperatureBoiler : Alarm
{
    //проверить работоспособность циркуляционного насоса
    //проверить наличие перепада давления на насосе
    //проверить циркуляцию котла и котлового контура
    //проверить датчики температуры котла и котлового контура
    //проверить аварийный термостат котла на работоспособность и соответсвие уставок
    //private string _nameAlarm = "Высокая температура бойлера";
    private void Awake()
    {
        _alarm = gameObject.GetComponent<HightTemperatureBoiler>();
        _nameAlarm = "Высокая температура бойлера";
        _taskAlarm = "1:проверить работоспособность циркуляционного насоса" +
                     "2:проверить наличие перепада давления на насосе" +
                     "3:проверить циркуляцию котла и котлового контура" +
                     "4:проверить датчики температуры котла и котлового контура" +
                     "5:проверить аварийный термостат котла на работоспособность и соответсвие уставок";
    }
    //public string GetNameAlarm() => _nameAlarm;
}
