
public class LowPressureGVS : Alarm
{
    //Проверить уровень воды в баке запаса воды
    //Проверить работоспособность насосов подпитки
    //Проверить(при необходимости прокачать) расширительный бак
    //Проверить на утечку, систему отопления
    //Проверить показания датчика давления
    //private string _nameAlarm = "Низкий давление в GVS";
    private void Awake()
    {
        _alarm = gameObject.GetComponent<LowPressureGVS>();
        _nameAlarm = "Низкий давление в GVS";
        _taskAlarm = "1:Проверить уровень воды в баке запаса воды" +
                     "2:Проверить работоспособность насосов подпитки" +
                     "3:Проверить(при необходимости прокачать) расширительный бак" +
                     "4:Проверить на утечку, систему отопления" +
                     "5:Проверить показания датчика давления";
    }
    //public string GetNameAlarm() => _nameAlarm;
}
